{"data":{"markdownRemark":{"html":"<h5>Types of Tax Preparers - Credentials and Qualifications</h5>\n<p>IRS Guidance\n<a href=\"https://www.irs.gov/tax-professionals/understanding-tax-return-preparer-credentials-and-qualifications\">https://www.irs.gov/tax-professionals/understanding-tax-return-preparer-credentials-and-qualifications</a></p>\n<p>UNLIMITED REPRESENTATION RIGHTS:\nEnrolled agents, certified public accountants, and attorneys have unlimited representation rights before the IRS. Tax professionals with these credentials may represent their clients on any matters including audits, payment/collection issues, and appeals.</p>\n<p>1.Enrolled Agents – Licensed by the IRS. Enrolled agents are subject to a suitability check and must pass a three-part Special Enrollment Examination, which is a comprehensive exam that requires them to demonstrate proficiency in federal tax planning, individual and business tax return preparation, and representation. They must complete 72 hours of continuing education every 3 years.</p>\n<p>2.Certified Public Accountants – Licensed by state boards of accountancy, the District of Columbia, and U.S. territories. Certified public accountants have passed the Uniform CPA Examination. They have completed a study in accounting at a college or university and also met experience and good character requirements established by their respective boards of accountancy. In addition, CPAs must comply with ethical requirements and complete specified levels of continuing education in order to maintain an active CPA license. CPAs may offer a range of services; some CPAs specialize in tax preparation and planning.</p>\n<p>3.Attorneys – Licensed by state courts, the District of Columbia or their designees, such as the state bar. Generally, they have earned a degree in law and passed a bar exam. Attorneys generally have on-going continuing education and professional character standards. Attorneys may offer a range of services; some attorneys specialize in tax preparation and planning.</p>\n<p>LIMITED REPRESENTATION RIGHTS:\nSome preparers without one of the above credentials have limited practice rights. They may only represent clients whose returns they prepared and signed, but only before revenue agents, customer service representatives, and similar IRS employees, including the Taxpayer Advocate Service. They cannot represent clients whose returns they did not prepare and they cannot represent clients regarding appeals or collection issues even if they did prepare the return in question.</p>\n<p>Tax return preparers who have an active preparer tax identification number (PTIN), can prepare Federal and State tax returns for their customers. They have no authority to represent clients before the IRS (except regarding returns they prepared and filed December 31, 2015, and prior).</p>\n<p>Note: Everyone described above must have an IRS issued preparer tax identification number (PTIN) in order to legally prepare your tax return for compensation.</p>\n<p>IRS Tax Preparer directory</p>\n<p><a href=\"https://irs.treasury.gov/rpo/rpo.jsf\">https://irs.treasury.gov/rpo/rpo.jsf</a></p>\n<p>Use <a href=\"https://www.taxprepnearme.com\">https://www.taxprepnearme.com</a> to find a professional tax preparer near you.</p>","frontmatter":{"title":"Types of Tax preparers - CPAs, Enrolled Agents, Tax Attorneys and PTIN holders","date":"June 10th, 2019","author":"Tax Preparer"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/articles/article-2/"}}